#include <bits/stdc++.h>

using namespace std;

long long n, s;

int main() 
{
    cin >> n;
    for (long long i = 1; i <= n; i++)    
    {
        long long x = i;
        for (long long j = 1; j < i; j++)
        {
            x *= i;
        }
        s += x;
    }
    cout << "for n = " << n << " s = " << s;
}

//n = 5 s = 3413
//n = 6 s = 50069
//n = 10 s = 10405071317
//n = 100 s = 5146238793346310720
//n = 200 s = -4137211680396737972
//n = 500 s = 6378643303420889616
//n = 1000 s = -6492551511798476564
//это происходит в результате переполнения long long, максимальные значения которого это где-то 2^63,
//а наши результаты гораздо больше